Can't make monolithic Stairs.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotCreateMonolithicStairs { get; }
  Visual Basic
Public Shared ReadOnly Property CannotCreateMonolithicStairs As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotCreateMonolithicStairs {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace